# 1. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და ბეჭდავს 1-დან "n"-მდე რიცხვების ჯამს.

# n = int(input('Enter a number: '))
# a = 0
# for i in range(1, n + 1):
#     a += i
# print(a)

# 2. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ იყენებს "while" ციკლს
# რომ რევესრულად დაბეჭდოს რიცხვები 0-მდე. მაგალითად თუ შეიყვანს 4, დაიბეჭდოს 4, 3, 2, 1

# n = int(input('Enter a number: '))

# while n > 0:
#     if n > 1:
#         print(n, end=', ')
#     else:
#         print(n)
#     n -= 1

# print()

# 3. დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს გამოიცნოს
# წინასწარ განსაზღვრული რიცხვი. როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, დაასრულებს პროგრამა მუშაობას.

# a = 13
# b = 0
# while a != b:
#     c = input('Guess a number: ')
#     b = int(c)

# print('You won')

# 4. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum = 0,
# შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. ეს პროცესი გაგრძელდეს იქამდე სანამ
# მომხმარებელი არ შეიყვანს 'sum' ტექსტს, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.

# total_sum = 0
# a = ''
# while a != 'sum':
#     a = input()
#     if a == 'sum':
#         print(total_sum)
#     elif int(a) > 0:
#         total_sum += int(a)
#     else:
#         continue



