# 1. შექმენით გლობალური ცვლადი int_list = [10,20,30,40] და დაწერეთ პითონის ფუნქცია,
# რომელიც  მიიღებს რიცხვს პარამეტრად და გლობალურ int_list სიაში ჩაამატებს პარამეტრად მიღებულ რიცხვს.

# int_list = [10,20,30,40]
# def fun(n):
#     global int_list
#     int_list.append(n)
#     return int_list

# print(fun(50))

# 2. დაწერეთ პითნის ფუნქცია რომელიც პარამეტრად იღებს რიცხვების სიას (ლისტს) და აბრუნებს რიცხვების ჯამს.
# პარამეტრად უნდა მიიღოს შემდეგი სია [100, 20, 30, 50, 5323, 3321, 22, 56, 700, 90, 10].

# def fun(li):
#     a = 0
#     for i in li:
#         a += i
#     return a

# print(fun([100, 20, 30, 50, 5323, 3321, 22, 56, 700, 90, 10]))

# 3. შექმენით გლობალური ცვლადი gl_str = "Global" და დაწერეთ პითონის ფუნქცია რომელიც ქმნის ლოკალურ ცვლადს
# იგივე სახელით რაც გლობალურ ცვლადს აქვს  (gl_str) და აბრუნებს ლოკალური ცვლადის მნიშვნელობას.

# gl_str = "Global"

# def fun():
#     gl_str = 100
#     return gl_str

# print(fun())

# 4. რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს ერთ პარამეტრს number და დააბრუნებს  ციფრების ჯამს
# (მაგალითად თუ ფუნქციამ მიიღო რიცხვი 12345, უნდა დააბრუნოს 15. რადგან 1+2+3+4+5 უდრის 15-ს).

# def fun(number):
#     numstr = str(number)
#     if len(numstr) == 1:
#         return number
#     return int(numstr[0]) + fun(int(numstr[1:]))

# print(fun(12345))

# 5. რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად სტრიქონს და
# დააბრუნებს მის შებრუნებულ (revers) სტრიქონს (მაგალითად  input: Hello   Output: olleH)

# def revers(a):
#     if len(a) <= 1:
#         return a
#     return revers(a[1:]) + a[0]

# print(revers('Hello'))
