# 1. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს და აბრუნებს სტრიქონის UTF-8 დაშიფრულ ვერსიას.

# a = input('Write Something: ')
# print(a.encode())

# 2. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს.
# ჩამოაშორეთ ზედმეტი ინტერვალები.
# ყველა სიმბოლო გადაიყვანეთ პატარა ასოებში და
# დაუმატეთ ქვესტრიქონი 'Python'.
# თუ შეყვანილ სტრიქონში არსებობს სიტყვა "python", ჩაანაცვლეთ "Python"-ით.

# a = input('Write Something: ').strip().lower().replace('python', 'Python') + '\nPython'
# print(a)

# 3. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს.
# პროგრამამ უნდა დააბრუნოს ახალი სტრიქონი,
# რომელიც შედგება შეყვანილი სტრიქონის პირველი ნახევრისაგან.

# a = input("Write Something: ")
# b = len(a) // 2
# print(a[:b:])

# 4. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს.
# string მოდულის გამოყენებით დაწერეთ შემოწმება.
# სტრიქონი ვალიდურია მაშინ, როდესაც ის შეიცავს მინიმუმ ერთ ლათინურ ასოსა და
# მინიმუმ ერთ ციფრს და ამავე დროს არ შეიცავს დამატებით სიმბოლოებს: '!', '~', '#', '$' და ა.შ.

# import re
# a = input("Write Something: ")
# b = r'[A-Za-z]+[0-9]+'
# c = r'[0-9]+[A-Za-z]'
# if re.fullmatch(b, a) or re.fullmatch(c, a):
#     print('Valid')
# else:
#     print('Not Valid')

# 5. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს,
# სტრიქონი გადაყავს ბაიტებში, ბეჭდავს მნიშვნელობას და შემდეგ კი
# გადაყავს ბაიტებიდან სტრიქონში და ბეჭდავს სტრიქონს.

# a = input("Write Something: ")
# b = a.encode()
# print(b)
# print(b.decode())


# 1. დაწერეთ პითონის პროგრამა, რომელიც დასაწყისში შექმნის ცარიელ სიას ([]), თუ მომხარებელი შეიყვანს
# სიმბოლო 'a'-ს, ნიშნავს რომ უნდა დაამატოთ სიაში რიცხვი; თუ აკრიფა 'r', სიიდან უნა წაიშალოს რიცხვი;
# 'e'-ს შეტანისას პროგრამამ უნდა დაასრულოს მუშაობა. მიღებული შედეგი დაბეჭდეთ კონსოლში.

# li = []
# a = ''
# while a != 'e':
#     a = input('Choose a/r/e: ')
#     if a == 'a':
#         b = int(input('Enter the number you want to add: '))
#         li.append(b)
#     elif a == 'r':
#         b = int(input('Enter the number you want to remove: '))
#         li.remove(b)
# print(li)

# 2. დაწერეთ პითონის პროგრამა, რომელიც შექმნის სიას my_list_1 = [43, '22', 12, 66, 210, ["hi"]], და შეასრულებს შემდეგ ნაბიჯებს:
# a. დაბეჭდავს 210-ის ინდექსს;
# b. დაამატებს ბოლო ელემენტში ტექსტს "hello";
# c. წაშლის მეორე ინდექსზე მდგომ ელემენტს და დაბეჭდავს სიას;
# d. შექმენით ახალი სია my_llist_2, რომელსაც ექნება my_llist_1-ის მნიშვნელობა,
# გაასუფთავეთ my_llist_2-ის მნიშნველობა და დაბეჭდეთ ორივე სია.

# my_list_1 = [43, '22', 12, 66, 210, ["hi"]]
# print(my_list_1.index(210))
# my_list_1[-1].append('Hello')
# my_list_1.pop(2)
# print(my_list_1)
# my_list_2 = my_list_1
# my_list_2.clear()
# print(my_list_1, my_list_2)

# 3. დაწერეთ პითნის პროგრამა, რომელიც მიიღებს ტელეფონის ნომერს და
# regex-ით შეამოწმებს შეყვანილი ნომერი იცავს თუ არა "(123) 456-789" ფორმატს,
# თუ იცავს დააბრუნეთ შეყნვაილი ტელეფონის ნომერი, წინააღმდეგ შემთხვევაში გამოიტანეთ "Invalid format" ტექსტი.

# import re
# a = input('Enter Phone Number: ')
# b = r'\([0-9]{3}\) [0-9]{3}-[0-9]{3}'
# if re.fullmatch(b, a):
#     print(a)
# else:
#     print('Invalid format')
