# 1. დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად n, და გამოიტანს ფიბონაჩის n რაოდენობის მიმდევრობას.

# def fibo(n):
#     a = [1 , 1]
#     for i in range(n - 2):
#         a.append(a[i] + a[i + 1])
#     return a
# print(fibo(10))

# 2. დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად ორ სტრიქონს და შეამოწმებს არის თუ არა სტრიქონები ანაგრამები
# (ანაგრამი არის სიტყვა ან შესიტყვება, რომელიც წარმოიქმნება სხვა სიტყვის ან შესიტყვების ასოების გადაადგილებით).
# მაგ.: race და care ანაგრამებია.

# def anagram(x, y):
#    z = sorted(x)
#    u = sorted(y)
#    if z == u:
#       print('Anagrams')
#    else:
#       print('Not Anagrams')

# a = input()
# b = input()

# anagram(a, b)

# 3. დაწერეთ პითონის ფუნქცია რომელიც მიიღებს n რიცხვს და დააბრუნებს მის ფაქტორიალს.

# def facto(n):
#     a = 1
#     for i in range(1, n + 1):
#         a *= i
#     return a

# print(facto(10))

# 4. დაწერეთ პითონის ფუნქცია რომელიც მიიღებს  ორ პარამეტრს, პირველს სტრიქონს და მეორეს სიმბოლოს.
# ფუნქციამ უნდა მოძებნოს სტრიქონში რამდენჯერ მეორდება პარამეტრად მიღებული სიმბოლო და დააბრუნოს  მისი რაოდენობა.

# def much(a, b):
#     n = 0
#     for i in a:
#         if i == b:
#             n += 1
#     return n

# a = input()
# b = input()
# print(much(a, b))